clear all;
clc;
close all;
syms x;
format short;

for i=1:20
    A(i)=i;
end
n=20;
%για την μετοχή της τραπεζας πειραιως
B1=[45.80,45.70,42.90,44.00,47.40,49.90,50.70,49.30,53.80,52.30,45.00,41.70,41.70,39.80,47.50,41.10,36.10,32.50,32.10,33.10];
pol2=Poluonumo(A,B1,2,n)
pol3=Poluonumo(A,B1,3,n)
pol4=Poluonumo(A,B1,4,n)
%για την μετοχή της εθνικής τραπεζας 
B2=[18.68,18.22,17.48,17.18,18.67,17.63,17.33,16.73,18.67,18.37,16.43,16.28,15.98,15.09,17.63,15.69,14.79,13.18,13.53,13.67]; 
pol2=Poluonumo(A,B2,2,n)
pol3=Poluonumo(A,B2,3,n)
pol4=Poluonumo(A,B2,4,n)
%για την μετοχή της ΣΕΛΟΝΤΑ
B3=[0.104,0.100,0.086,0.086,0.102,0.085,0.100,0.098,0.098,0.090,0.098,0.105,0.105,0.090,0.100,0.092,0.074,0.074,0.074,0.074];
pol2=Poluonumo(A,B3,2,n)
pol3=Poluonumo(A,B3,3,n)
pol4=Poluonumo(A,B3,4,n)